import 'package:unicef/model/quiz.dart';

final List quizzes = [
  new Quiz(
      "كيف تُقيّم ردّة فعلك هذه؟",
      [
        "صديقي القرّب لا ضرر في ذلك",
        "كان عليّ أخذ الإذن من أهلي",
        "انا لا ادري "
      ],
      1,
      2),
  new Quiz(
      " ما هي أفضل / أأمن وسيلة لارسال المعلومات ؟",
      [
        "الرسائل النصيّة القصير",
        " البريد الالكتروني",
        "عدم الارسال على الاطلاق"
      ],
      2,
      4),
  new Quiz(
      " ماذا تفعل في هذه الحالة ؟",
      [
        "أفتح الرابط واقرأ النشرة جيّدا و أُقرّر تحميل التطبيق او لا",
        "أفتح الرابط و أحمّل التطبيق استنادا للملخص المعروض ",
        " أكمل نومي"
      ],
      2,
      0),
];
