import 'package:unicef/model/quiz.dart';

final List quizzes = [
  new Quiz(
    "كيف تُقيّم ردّة فعلك هذه؟",
    [
      "صديقي القرّب لا ضرر في ذلك",
      "كان عليّ أخذ الإذن من أهلي",
      "انا لا ادري "
    ],
    1,
    justification:
        " أخذ إذن الأهل واجب قبل إتّخاذ أيّ قرار لضمان الأمن و السلامة",
  ),
  new Quiz(
      " ما هي أفضل / أأمن وسيلة لارسال المعلومات ؟",
      [
        "الرسائل النصيّة القصير",
        " البريد الالكتروني",
        "عدم الارسال على الاطلاق"
      ],
      2,
      justification:
          "بريدك الإلكترونى هو المدخل إلى حياتك الشخصية، ولهذا السبب هو هدف ثمين للقراصنة ومجرمى الإنترنت",
      knowMoreLink: "https://youtu.be/l81bevjAr-c"),
  new Quiz(
      " ماذا تفعل في هذه الحالة ؟",
      [
        "أجرّب حظّي و افتح الحساب بمفردي",
        "انتظر عودة أبي",
        " أبحث على الانترنت عن طريقة فتح بريد الكتروني"
      ],
      1,
      justification:
          "فتح بريد الكتروني يتطلّب ادخال معلومات شخصيّة حسّاسة لا يمكن التلاعب بها أو مساركتها مع الجميع"),
  new Quiz(
      " ماذا تفعل في هذه الحالة؟",
      [
        "ليس به ضرر مادام الكل تفحّص اللعبة",
        " أطلب تصريح  والدي ",
        " اتأكّدمن ملاءمة التطبيق لهاتفي ثم أحمّله  "
      ],
      1,
      justification:
          "يغتنم بعض القرانصة فرصة جهل بعض المستعملين للولوج لمعطيات الهاتف كلّما سنحت لهم الفرصة. لذلك استشارة الأولياء لا بدّ منها للتقليل منها و حماية الخصوصيّة",
      knowMoreLink: "https://youtu.be/oWo3yS1YM84"),
  new Quiz(
    " ماذا يكون جوابك اذا وصلتك رسالة في الليل؟",
    ["اجيب فور ا", " لا أجيب اطلاقا ", " أنتظر الصباح "],
    2,
    justification:
        "التحديق لوقت طويل في شاشات الأجهزة الإلكترونية يخفف إفراز هرمون الميلاتونين، وهو الهرمون الذي يتم إفرازه عادة خلال الليل. ويسبب قلة إفراز الميلاتونين اضطراب عادات النوم، وبالتالي ضعفاً في الذاكرة والانتباه والتركيز ",
  ),
  new Quiz(
    "ماذا تفعل؟",
    [
      "أنتظر حتى أبلغ 16 سنة ",
      "لا يجب الدخول الى مواقع كهذا",
      "لا ضرر في ذلك فالكل قاموا بزيارته"
    ],
    1,
    justification:
        "أثبتت الدراسات الحديثة في الجامعات العالميّة الدخول لمواقع ذات محتوى غير ملائم لعمر الطفل قد تسسب له اضطرابات نفسيّة التي تؤثّر مع مرور الوقت في تكوين شخصيّته",
  ),
  new Quiz(
    " ما رأيك؟",
    [
      "لا لا يجوز ارسال رسائل من هذا النوع ",
      " نعم يجب ان يعترف بخطئه و يتحمل مسؤوليته ",
      "تقوم بإهانته و تحجبه عن هاتفك"
    ],
    0,
    justification:
        " يجب إحترام الطرف الآخر ، و لا تغتنم وجودك خلف شاشة الهاتف لتقول ما يحلو لك",
  ),
  new Quiz(
    "ماذا تفعل في هذه الحالة؟",
    [
      "بما أنه بعث لي صوره يمكنني انا ايضا ان ابعث له",
      " احضره من قائمة اصدقائي",
      "لا ابعث صوري "
    ],
    2,
    justification:
        " لا يمكن أن تثق في أصدقائك الافتراضيين , فقد يمكن أن يكون للشخص نوايا سيئة",
  ),
  new Quiz(
      "ماذا تفعل؟",
      [
        "تضغط على الرابط لكي لا يُغلق حسابك",
        "تواصل الحديث مع الشخص المجهول للاستفسار اكتر",
        " تتجاهل الرسالة ,و تقوم بحجب الشخص المجهول"
      ],
      2,
      justification:
          "تجاهل اي رسالة تصلك من شخص مجهول، فهؤلاء عموما يريدون الإيقاع بك ",
      knowMoreLink: "https://youtu.be/qrp0hFceNFQ"),
  new Quiz(
    "ماذا عساك تفعل؟",
    [
      "أخصص الوقت الذي أقضيه مع عائلتي للمذاكرة، و الوقت المتبقي لإستخدام الهاتف",
      " أحجب كل أصدقائي على مواقع التواصل الاجتماعي",
      " أخصص وقتا محددا للمذاكرة، و أستخدم الهاتف في أوقات فراغي"
    ],
    2,
    justification:
        " يجب أن تنظم وقتك ، تضبط نفسك، ولا تضحي بأولوياتك في سبيل إستعمال الهاتف",
  ),
];
