import 'story.dart';
import 'page.dart';

final List stories = [
  new Story([
    new Page("assets/newPhone.png",
        "تحسّن مردودك الدراسّي مؤخّرا و حققت تطورا ملحوظا في النتائج التي تحصّلت عليها, فقرّر والدك مكافأتك بهاتف ذكي/ لوحة ذكيّة كامل و متكامل الاكسسوارات, تشجيعا منهم لك و عرفانا بمجهوداتك التي بذلتها طيلة الموسم الدراسي"),
    new Page(
      "assets/street.png",
      "سارعت فور حصولك على الهديّة إلى صديقك المقرّب لتُريه ايّها و كلك فرح و سرور",
    ),
  ], 0),
  new Story([
    new Page("assets/newPhone.png",
        " عدت الى المنزل و بدأت باستعمالك جهازك الجديد, و أوّل ما يخطر على البال هو تحميل بعض الالعاب و التطبيقات لتكتمل المتعة"),
    new Page(
      "assets/newPhone.png",
      "عند دخولك تطبيق التحميل: متجر التطبيقات , طُلب منك ادخال البريد الالكتروني وكلمة المرور. لكن مع الأسف ليس بحوزتك لا بريد الكتروني و لا كلمة مرور. اتصّلت بأحد أصدقائك و طلبت منه إرسال المعلومات المطلوبة في رسالة نصّية",
    ),
  ], 1),
  new Story([
    new Page(
      "assets/night.png",
      "ساعدك والدك عند عودته في فتح الحساب و تحميل بعض الالعاب و التطبيقات بعد أن تأكّد من موالمتها لسنّك و مجتمعناساعدك والدك عند عودته في فتح الحساب و تحميل بعض الالعاب و التطبيقات بعد أن تأكّد من موالمتها لسنّك و مجتمعنا",
    ),
    new Page(
      "assets/night.png",
      "حلّ الليل و أنهكك التعب و حان وقت النوم. من شدّة فرحك بالهديّة قررت وضعها أمام رأسك لتطمأنّ عليها. ما ان غفوت حتى اهتزّ الهاتف تنبيها منه بتلقّي رسالة فيها دعوة لتحميل تطبيق جديد في المتجر مع معلومات عنه تُفيد بأنه تطبيق لتعليم اللّغات و نختلف الثقافات",
    ),
  ], 2),
];
