import 'story.dart';
import 'page.dart';

final List stories = [
  new Story([
    new Page("assets/newPhone.png",
        "تحسّن مردودك الدراسّي مؤخّرا و حققت تطورا ملحوظا في النتائج التي تحصّلت عليها, فقرّر والدك مكافأتك بهاتف ذكي/ لوحة ذكيّة كامل و متكامل الاكسسوارات, تشجيعا منهم لك و عرفانا بمجهوداتك التي بذلتها طيلة الموسم الدراسي"),
    new Page(
      "assets/street.png",
      "سارعت فور حصولك على الهديّة إلى صديقك المقرّب لتُريه ايّها و كلك فرح و سرور",
    ),
  ], 0),
  new Story([
    new Page("assets/streetAlone.png",
        "أوّل ما يخطر على البال هو تحميل بعض الالعاب و التطبيقات لتكتمل المتعة. و عند دخولك تطبيق التحميل: متجر التطبيقات طُلب منك ادخال البريد الالكتروني وكلمة المرور. لكن مع الأسف ليسو ا بحوزتك"),
    new Page(
      "assets/streetAlone.png",
      "اتصّلت بأحد أصدقائك و طلبت منه إرسال المعلومات المطلوبة في رسالة نصّية",
    ),
  ], 1),
  new Story([
    new Page(
      "assets/angry_morning.png",
      "رفض صديقك اعطاءك بريده الالكتروني وكلمة المرور الخاصين به . لذلك عليك فتح حسابك الخاص",
    ),
  ], 2),
  new Story([
    new Page("assets/newPhone.png",
        "ساعدك والدك عند عودته في فتح الحساب و تحميل بعض الالعاب و التطبيقات بعد أن تأكّد من موالمتها لسنّك و مجتمعنا."),
    new Page(
      "assets/street2.png",
      "توجهت مع أبيك لزيارة أقاربك. كان الاطفال هناك يتحدثون عن لعبة جديدة قاموا بتحميلها على أجهزتهم الذكيّة, فأثاروا فضولك و أردت تحميلها بدورك ",
    ),
  ], 3),
  new Story([
    new Page(
      "assets/night.png",
      "اقترح  الاطفال انشاء حساب على واحد من مواقع التواصل الاجتماعي للدردشة و تبادل الاخبار و  تمضية السهرة معا ",
    ),
  ], 4),
  new Story([
    new Page(
      "assets/school.png",
      "سمعت الاطفال في يتحدثون عن موقع الكتروني لمسموح لسنّ 16 سنة فما فوق",
    ),
  ], 5),
  new Story([
    new Page(
      "assets/angry_night.png",
      "لم تتفق انت و احد الاطفال و اثار غضبك فأردت ان تبعث له رسالة لتخبره بانك لا تود مصاحبته بعد الان",
    ),
  ], 6),
  new Story([
    new Page(
      "assets/streetAlone.png",
      "تعرفت على صديق على احد مواقع التواصل الاجتماعي وبعث لك بعض الصور له و لعائلته ثم  طلب منك ان تبعث له صورة لعائلتك ايضا",
    ),
  ], 7),
  new Story([
    new Page(
      "assets/angry_morning.png",
      "خلال تلك الأثناء تصلك رسالة من شخص مجهول يطلب منك الضغط على الرابط الذي يلي رسالته و الا سوف يغلق حسابك",
    ),
  ], 8),
];
